[MID_CreditsIntro]
[eng]
Congratulations on making it through to the end. DROD is a challenging game in any of its forms.

It took us over four years to develop and complete *Gunthro and the Epic Blunder*, and this game's development was not without the usual obstacles.  This game was coyly announced in the closing credits to *The City Beneath*.  The game was originally titled *Frogs and Mice*, and was not planned as a DROD sequel, but after a series of unfortunate events, we decided to retheme it as a traditional DROD game.  This is likely good news for you, oh steadfast follower, who can't get enough of DROD and the Eighth.

DROD has always been a labor of love.  On previous DROD games, I would put in endless hours in order to get the game out the door for Caravel's traditional April 1st deadline.  As time goes on, living the indie game development dream has vied for attention with raising a family, maintaining a house, a full-time day job, and basically everything else that can be a part of life.  Fortunately, I've had a stalwart group of allies to help develop this game.  This is a game, for DROD fans, by DROD fans.  You'll see their names in lights below, but let me stress that this game likely would not have been completed, and without this level of polish, without their enthusiasm, energy and skill.

Though we've taken a break from telling the story of Beethro in this installment of the DROD franchise, it does explain Beethro's origins and some of where he got his undying curiosity to explore the great Beneath.  I'll let you know now that the Caravel team soon will begin work on DROD 5.  This will likely be the final entry in the series that began with *King Dugan's Dungeon*, *Journey to Rooted Hold*, and *The City Beneath*.  Also, there have been the Smitemaster's Selections that have filled in some gaps leading up to the series climax.  The fifth and final game, "The Second Sky", will mark the end of Beethro's investigations in the Great Beneath, and the beginning of his actions in aid of the surface.  You'll finally learn all about the Grand Event, and may that knowledge shock you to the very core, as it will Beethro.

I'd expect that game to be released in a few more years.  Keep watch out for it on the Caravel Forum, where I'm sure we'll dust off the ol' Progress Bar and keep you apprised on the team's progress.

And now, the credits...

[MID_ErikH]
[eng]
Erik Hermansen

[MID_ErikH_C]
[eng]
Creator, Concept, Game Elements, Story, Art

[MID_ErikH_Text]
[eng]
Erik is the father of DROD and creator of this game's original story when it was *Frogs and Mice*.  Erik proposed the ideas for the new game elements that appear in this game.  He also drew the flavorful portrait art for the various characters.

Erik came up with the original concept of DROD back in the nineties.  He comes back once in a while to contribute more to the DROD story, and he deserves an honorary spot at the top of the credits for this gaming invention that has enriched all our lives.

[MID_MikeR]
[eng]
Mike Rimer

[MID_MikeR_C]
[eng]
Producer, Lead Programmer, Level Design, Art Direction, Voice and Testing Coordination, Sound Effects and Voice Editing

[MID_MikeR_Text]
[eng]
I've featured less prominently in this title as a programmer and level designer and more of a project manager.  I tweaked the story, room design, script text, and implemented some features here and there.

The majority of the dialogue was written by the level designers, which is an unusual practice that works quite well for us.  I cast the voice actors for the parts and made sure all the lines got recorded.  Some in-game art I made was inherited from previous games, and I added a little more.  The cover illustration for the game is mine too.

Please consider that even though I tend to be the "voice" of the Caravel team--it is just that, a team. In fact, I'm arguably not the person who has done the most work on this project.  Each person listed below has done a whole ton of work, or at least several dozen kilograms, for this title.  They've all done it for the love of the game, and I am extremely grateful for all of their contributions.

[MID_MattS]
[eng]
Matt Schikore

[MID_MattS_C]
[eng]
CaravelNet Design and Programming

[MID_MattS_Text]
[eng]
The CaravelNet functionality belongs to Matt. He implements a non-stop stream of changes to the Caravel Forum. Other indie developers out there would not even dream of attempting the stuff we have working. A larger retail developer/publisher company like EA or Blizzard would probably spec out a CaravelNet-like project to take a five-person team multiple man-years of work. Somehow, some way, one guy has delivered this huge amount of functionality. I would not recommend anyone else try doing it, unless they have Matt Schikore working for them.

[MID_JacobG]
[eng]
Jacob Grinfeld

[MID_JacobG_C]
[eng]
Level design, Story, Scripting, Help docs

[MID_JacobG_Text]
[eng]
Jacob has been making quality DROD holds for a long time now, and he made a large number of quality rooms for this game.  However, he didn't stop there.  Jacob has put in an uncountable number of hours to help retheme the game's hold from F&M into a story in the Eighth about Gunthro.  Jacob has added practically all of the game's bonus, secret and meta-content.  Jacob provided input on game element design and updated the game help files.  He has done a lot of tuning to the levels, scripting and story, and did a great job of keeping the project moving along the whole time.  His commitment to this project cannot be overstated.

[MID_TerenceF]
[eng]
Terence Fergusson

[MID_TerenceF_C]
[eng]
Programming, Game Element Design, CaravelNet

[MID_TerenceF_Text]
[eng]
Terence has also put in a huge number of hours fixing bugs and making things work better in the DROD engine.  He is a coding machine that has quickly picked up the DROD codebase and adeptly added new functionality.  He spent a lot of time getting the details for the new features in DROD 4.0 just right, and then went ahead to produce the excellent "Flood Warning" hold that comes bundled with the game, showcasing the neat ideas he came up with for the shallow water and stepping stones game elements.  Terence also worked on improving CaravelNet functionality and also handled many of the tedious, unglamorous tasks that just needed somebody to do it, like fixing bugs, tightening loose bolts in the rendering engine, and making sure all of the new and preexisting game elements interacted with just right.  It seemed like every time I turned around Terence had some good new idea already implemented in the game.  His contribution is huge, and we hope he sticks around to do more great things for DROD:TSS!

[MID_LarryM_HenriK]
[eng]
Larry Murk, Henri Kareinen

[MID_LarryM_HenriK_C]
[eng]
Level design

[MID_LarryM_HenriK_Text]
[eng]
Larry and Henri are also star level designers that work tirelessly to make DROD the best game that it can be.  They made many well-designed levels that were a joy for me to play through.  DROD is more than just the sum of its rooms, but without their critical contribution to this game, it wouldn't be of the high caliber it is today.

[MID_JonS]
[eng]
Jon Sonnenberg

[MID_JonS_C]
[eng]
Music

[MID_JonS_Text]
[eng]
Jon is a professional musician who has a band (Travelogue) and recording label agreements to distribute his music. Erik, a long-time fan of Jon's, cold-called him years back to request game music for *The City Beneath*.  Jon agreed and came up all the great music for that game.  We adore his work.  Jon came back to work with us again for DROD 4, providing over an hour of new music for the *Gunthro and the Epic Blunder* soundtrack. Nice!

[MID_GerryJ]
[eng]
Gerry Jo Jellestad

[MID_GerryJ_C]
[eng]
Programming, Linux port, Tile art

[MID_GerryJ_Text]
[eng]
It is hard to find someone that will take over a responsibility and stick with it for years. If you are playing DROD on Linux, you owe a lot of thanks to Gerry, who has provided Linux ports for all of the DROD games and their patches.  Gerry also provided the original implementation for the new game elements in DROD 4 and some beautiful tile art for the game.

[MID_EytanZ]
[eng]
Tom Brouws, Eytan Zweig

[MID_EytanZ_C]
[eng]
Dialogue, Continuity, Testing

[MID_EytanZ_Text]
[eng]
Tom has been with us throughout the project helping out on story, faithfully testing builds, and making most of the demos that you see from the title screen.  Eytan popped in both at the beginning and end of this project to help us get the story right.

[MID_NeilF]
[eng]
Neil Frederick

[MID_NeilF_C]
[eng]
Level design

[MID_NeilF_Text]
[eng]
We've been working with Neil for a long time. He's an excellent level designer that knows how to make challenging rooms fun to play--not just hard.

[MID_BrettB]
[eng]
Brett Boyette

[MID_BrettB_C]
[eng]
Art

[MID_BrettB_Text]
[eng]
Erik hired Brett Boyette to make the tile art for the three new room styles featured in this game.  She also made a bunch of early game art for *Frogs and Mice*, which unfortunately didn't make it into the game, but which you can still find some of in the game's mastery level.

[MID_JenniferL]
[eng]
Jennifer Loeser

[MID_JenniferL_C]
[eng]
Story, Tile art, Testing, Continuity

[MID_JenniferL_Text]
[eng]
Jennifer is a great level tester.  She provided valuable story feedback and put in a lot of work to good effect as an early alpha playtester.  She also upgraded the force arrow tile art, making it more crisp and easier to see, especially in the new room styles.

[MID_WaiL]
[eng]
Wai Lam

[MID_WaiL_C]
[eng]
Art

[MID_WaiL_Text]
[eng]
Wai has been of great assistance, spending a lot of time in testing and also adding polish to the game cover images you see on the Caravel website.  He also created the new game logo.

[MID_LoganW]
[eng]
Logan West

[MID_LoganW_C]
[eng]
Voice work

[MID_LoganW_Text]
[eng]
I want to give a great, big shout-out to Logan West for supplying the voice of Gunthro, and for his infinite versatility across many character roles in this and other Caravel projects.  Logan could seriously consider a role in professional voice work, because I think he could contend with everyone else out there that's getting paid for that type of gig.  With both arms tied behind his back, and a leg!

[MID_VoiceTalent]
[eng]
The Cast

[MID_VoiceTalent_C]
[eng]
Voice Talent

[MID_VoiceTalent_Text]
[eng]
These are the actors who recorded parts for the game.  There is a large group here, and everyone you see here was hand-picked for their work.  We're glad to have their contribution, and I hope you enjoyed their performance.

Logan West - Gunthro Budkin, Citizens and Soldiers
Daniel Mellman - Beethro
Seth Rimer - Halph
Michael Abbott - Tuenan Captain
David Ault - 6th Patron, Citizens and Soldiers
Chris Marks - Rock Golems, Gulric Dawnmace, Merin Calmwind
John Rogers, Jr. - True Court Lackey, General Drokkendutt
Johannah West - Aurora Bladeseeker, Soldier's Mother
Maurycy Zarzycki - Court Lackey, Brain
Brian Richardson - Ardus Frostbard
Ryan Peterson - Old Greybeard, Soldiers
Samuel Benner - Sand Key Bearer, Citizen
Mike Rimer - Swamp Guide
Bit Parts - almost everyone above

[MID_LevelDescriptionWriters]
[eng]
12th Archivist
George Wanfried (Chaco)
Ryan Berry
Lance Nathan
Annatala Wolf (Trickster)


[MID_LevelDescriptionWriters_C]
[eng]
Level Description Texts

[MID_LevelDescriptionWriters_Text]
[eng]
In a previous Caravel Forum contest, we challenged players to come up with some interesting description texts for areas of the new game.  We ended up using some texts written by these awesome fans in the game, so they deserve a place in the credits too!

[MID_Testers]
[eng]
Eytan Zweig
Jennifer Loeser
Seth Rimer
Wai Lam
Sean Hunt
Markus Theelen
Tom Brouws
Brad Wall

[MID_Testers_C]
[eng]
The Testers

[MID_Testers_Text]
[eng]
At any chance given to me, I will brag about our testers. I really think it is possible that we have the best volunteer game testers in the world. Other indie game developers get unhelpful bug reports like "Hmm. Something doesn't work for me. Game crashed." A Caravel tester will say, "I was in 6N2E on Glum Cove, and just as I moved east off the edge of the screen, but before it began scrolling, the screen went black. Music continued to play, but I was unable to do anything after that. I restarted from a save game, tried it again, and it did the same thing. Attached is a copy of the error log. This looks similar to the bug that Stefan reported earlier--maybe the same thing? Let me know if you want me to run any more tests." Get the idea? Our testers are intelligent, articulate, and dedicated to the game. I am proud to be associated with them.

[MID_CreditsLastWords]
[eng]
This project had a much larger scope than originally intended, but it's all to the good.  There are more people who have contributed in various indirect ways.  Every individual's contribution to this game is important, and I apologize if I left you out when you were expecting a mention.  Any omissions were unintentional.




Hey, since you're still reading, I'll let you in on a little secret.  Did you know that this game contains a secret code, just like at the end of *The City Beneath*, just for those who have completed the game?  This is a secret just for people who have completed the entire game.



...

However, I'm not going to tell it to you right here.  You're actually going to have to go back into the game before Gunthro sails off for Ephelna and do some snooping around.  You'll also need to master the hold by finding and conquering all of the secret rooms, and then going through the secret mastery level.  It will send you off after even more post-mastery secrets found around the game.  If you are one of those who thought this game was too short or too easy, and wanted some of the usual rock-hard DROD challenges and obscure secrets, then fear not -- we have some more appropriately challenging content still tucked away in here just for you.  But I won't spoil any more of it now.

We hope that you have enjoyed this game and Gunthro's story of the Epic Blunder.

Have fun DRODing! We all thank you for playing.

-Mike

[MID_CreditsTheEnd]
[eng]
Gunthro and the Epic Blunder

(c) 2012 Caravel Games, LLC
www.caravelgames.com
